{
  "about": {
    "title": "About chop suey",
    "description": "Chop Suey Books: Richmond’s Beloved Literary Haven",
    "body": "Nestled in the vibrant heart of Carytown, Richmond, VA, Chop Suey Books is more than just a bookstore—it’s a beloved literary destination. Known for its eclectic mix of new and used books, lively events, and a specially curated youth section, Chop Suey has been spotlighted by The New York Times and praised as Virginia’s top bookstore. Over the years, it’s become a haven for readers and authors alike, even making its mark in a novel by The New Yorker writer Gary Shteyngart."
  },
  "overview": {
    "title": "Overview",
    "description": "Transforming Chop Suey Books: A Cozy, Curated Online Experience",
    "body": "The goal of this project was to re-imagine Chop Suey Books’ digital storefront to drive online sales while embodying the essence of a cozy, independent bookstore. To achieve this, the design needed to offer an enjoyable shopping experience, feature engaging product information, and ensure a seamless checkout—all wrapped in Chop Suey’s unique and welcoming brand vibe."
  },
  "problem": {
    "title": "Problem statement",
    "description": "Redesigning for Ease: Clear Details, Great Deals, and a Seamless Checkout",
    "body": "Users browsing Chop Suey Books’ website struggle to find the information they need and miss the local business feel they want to support. As a result, they aren’t completing purchases, leading to lost revenue for the store."
  },
  "users": {
    "title": "Users",
    "description": "From Quality Seekers to Deal Hunters: Designing for Every Shopper’s Need",
    "body": "Chop Suey’s users include the Careful Critic, a detail-oriented shopper seeking quality information to make informed purchases, and the Deal Diver, a budget-conscious customer hunting for the best value. Both prioritize supporting local businesses but encounter frustrations like incomplete product details and hidden fees, highlighting the need for clear information, accessible discounts, and an intuitive, user-friendly experience."
  },
  "role": {
    "title": "My Role",
    "description": "Designing with Purpose: Merging Brand Vision and User Needs",
    "body": "As the sole UI designer, I dove deep into the provided business needs, brand identity, and user personas to truly understand their unique motivations and frustrations. Working within a focused one-week sprint, I guided each stage of the design journey—from empathizing to testing—crafting a cohesive, user-centered experience that aligned seamlessly with Chop Suey’s distinct brand essence."
  }
}
