{
  "overview": {
    "title": "overview",
    "description": "Where beats meet innovation: connecting drum & bass DJ's and fans.",
    "body": "This project aimed to design an all-in-one platform for underground drum & bass DJs and their fans. By addressing discoverability challenges, fragmented user experiences, and limited monetization options for DJs, the platform seeks to centralize live streaming, community interaction, and direct support for artists. Additionally, it strives to foster a stronger sense of community and provide comprehensive tools that support DJs in building sustainable careers and creating a thriving music ecosystem."
  },
  "problemStatement": {
    "title": "problem statement",
    "description": "Where beats unite but platforms divide: closing the gap between DJs andfans",
    "body": "The drum & bass community lacks a unified platform that caters to the unique needs of DJs and fans. DJs struggle with discoverability, fragmented streaming workflows, and limited revenue streams, while fans face challenges in discovering new talent, staying engaged, and supporting their favorite artists. The goal of this project is to create a seamless, community-driven experience that fosters connections between DJs and fans, improves content discoverability, and provides robust monetization tools."
  },
  "role": {
    "title": "my role",
    "description": "Shaping a seamless experience: from user research to final design.",
    "body": "As the Lead UX Designer, I was responsible for conducting user research, creating personas, empathy maps, and user stories, and developing user flows, sitemaps, and wireframes. I designed both low-fidelity and high-fidelity mockups, collaborated with stakeholders for feedback, and iterated based on testing insights. This was a solo UX design project where I worked closely with community stakeholders and DJs to ensure their needs were met."
  },
  "constraints": {
    "title": "constraints",
    "description": "MVP on a mission: proving impact within tight constraints.",
    "body": "This project was conducted over a two-week period as an MVP to demonstrate basic functionality for solving user problems. The primary goal was to showcase the platform’s potential to stakeholders, specifically recruiters and hiring managers, in order to secure a job opportunity. The business requirements emphasized delivering this MVP as soon as possible while focusing on key features that address user needs."
  },
  "empathize": {
    "title": "design process",
    "description": "Listening to the beat of the community: understanding DJs and fans.",
    "body": "To understand the needs of DJs and fans, I conducted eight user interviews and created empathy maps to capture what users say, think, do, and feel. These insights led to the development of two key personas representing DJs seeking growth and fans craving seamless engagement. User stories and journey maps highlighted pain points and opportunities, forming the foundation for meaningful design decisions.",
    "interviewCards": {
      "busyBryan": {
        "name": "Busy Professional Bryan",
        "image": "https://utfs.io/f/itB1v1cNMItpy4f89czjhovRdHOm3UWrDY204p5qQJlTxwLE",
        "bulletPoints": "['The app’s slow performance makes it hard to order quickly', 'The checkout process is so complicated; it takes too long to place an order.', 'The app’s navigation is confusing, and finding what I want is difficult. I just want that app to be fast and simple to use.']"
      },
      "focusedFiona": {
        "name": "Family-Focused Fiona",
        "image": "https://utfs.io/f/itB1v1cNMItpy2TkSljhovRdHOm3UWrDY204p5qQJlTxwLEf",
        "bulletPoints": "['I need better filtering options for my dietary needs.', 'I often host events and need the option to schedule orders in advance.', 'I find that current apps  lack of family meal options make it difficult to order  for my family especially on a budget. ']"
      }
    }
  },
  "define": {
    "description": "Clarifying the challenge: aligning user needs with design goals.",
    "body": "The research revealed that DJs and fans need a unified platform to address fragmented tools that hinder discoverability, engagement, and revenue generation. I crafted a problem statement and hypothesis statements for both DJs and fans, outlining how centralized streaming, profile management, and interactive features could enhance their experiences. A clear goal statement was created to guide the design, focusing on improving engagement, discoverability, and monetization, with metrics for success including user retention, engagement rates, and direct support transactions."
  },
  "ideate": {
    "description": "Turning Competitor Weaknesses into a Personalized, Efficient Ordering Experience",
    "body": "In the ideate phase, I conducted a competitive audit of Uber Eats, Grubhub, and DoorDash, identifying strong customization features but noting cluttered interfaces, slow performance, and a lack of personalization. This led to key \"How Might We\" questions, such as improving speed and providing a personalized experience, which guided our focus on streamlining the user flow and reducing steps in the ordering process. These insights drove our design improvements to create a more efficient, user-friendly app."
  },
  "sketches": {
    "description": "Turning Rough Ideas into a Streamlined, Personalized Café Experience",
    "body": "Also in the ideate phase, I created initial sketches to explore various design solutions, focusing on simplifying the user flow and enhancing customization options. These early sketches helped visualize different concepts and allowed me to quickly iterate on ideas before moving to wireframes. They served as the foundation for defining key features, such as navigation and personalized ordering."
  },
  "prototype": {
    "description": "Streamlined Flows and Intuitive Navigation for a Personalized Café Experience",
    "body": "In the prototype phase, I designed user flows that simplified the ordering process, allowing users to browse menus and complete checkout in just a few steps. The information architecture (IA) ensured intuitive navigation with easy access to key features like the home screen, cart, and orders. Logical menu categories, along with search and filter options, provided a seamless and personalized user experience."
  },
  "testing": {
    "description": "Enhancing User Experience with Clear Confirmations, Visible Actions, and New Features",
    "body": "During prototype testing, usability issues like unclear reward confirmation and difficulty finding the next call-to-action button were identified and addressed with added confirmation messages and improved button visibility. Missing features, such as tip options and delivery scheduling, were added in later iterations. These improvements, along with enhanced visual feedback for cart updates, significantly improved the app's intuitiveness and user experience."
  },
  "designSystem": {
    "description": "Mi Amor’s vibrant colors and clean typography blend to create a culturally inspired, seamless experience.",
    "body": "To reflect Mi Amor’s Latin American roots, I based the color scheme on the warm, earthy tone #D0AC6E, inspired by regional architecture and everyday items. All additional colors, including call-to-action elements, were chosen to complement this primary shade, with green for success and red for danger. For typography, I selected Proxima Nova, using a simple, professional approach with three font sizes and varying weights to create hierarchy and clarity."
  },
  "highFidelity": {
    "description": "A Minimalistic Design Delivering Real-Time Tracking, Nutritional Info, and Personalized Order Scheduling",
    "body": "To reflect Mi Amor’s Latin American roots, I based the color scheme on the warm, earthy tone #D0AC6E, inspired by regional architecture and everyday items. All additional colors, including call-to-action elements, were chosen to complement this primary shade, with green for success and red for danger. For typography, I selected Raleway, using a simple, professional approach with three font sizes and varying weights to create hierarchy and clarity."
  }
}
